cask_args appdir: '/Applications'

# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install Binaries
brew 'ansible'
brew 'automysqlbackup'
brew 'cmatrix'
brew 'composer'
brew 'coreutils'
brew 'dnsmasq'
brew 'exa'
brew 'ffmpeg'
brew 'findutils'
brew 'git'
brew 'git-extras'
brew 'grep'
brew 'httpie'
brew 'imagemagick'
brew 'mas'
brew 'mackup'
brew 'mongodb'
brew 'moreutils'
brew 'mtr'
brew 'mysql'
brew 'nginx'
brew 'ngrep'
brew 'nmap'
brew 'node'
brew 'nvm'
brew 'openssh'
brew 'openssl'
brew 'python'
brew 'python3'
brew 'reattach-to-user-namespace'
brew 'rsync'
brew 'screen'
brew 'source-highlight'
brew 'trash'
brew 'tree'
brew 'tmux'
brew 'vim'
brew 'wget'
brew 'wifi-password'
brew 'yarn'

# Apps
cask '1password'
cask 'airfoil'
cask 'airparrot'
cask 'alfred'
cask 'appcleaner'
cask 'arq'
cask 'betterzip'
cask 'chronosync'
cask 'cyberduck'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'duet'
cask 'firefox'
cask 'firefox-nightly'
cask 'forklift'
cask 'flux'
cask 'google-adwords-editor'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'google-web-designer'
cask 'gyazo'
cask 'hyper'
cask 'imagealpha'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'java'
cask 'kaleidoscope'
cask 'mailplane'
cask 'macdown'
cask 'ngrok'
cask 'opera'
cask 'powerphotos'
cask 'screenflow'
cask 'sequel-pro'
cask 'shuttle'
cask 'sketch'
cask 'slack'
cask 'sourcetree'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
cask 'suspicious-package'
cask 'toggl'
cask 'torbrowser'
cask 'torguard'
cask 'tower'
cask 'transmission'
cask 'tunnelblick'
cask 'vagrant'
cask 'vagrant-manager'
cask 'validator-sac'
cask 'visual-studio-code'
cask 'vlc'
cask 'vmware-fusion'

# Quicklook
cask 'qlcolorcode' # Preview source code files with syntax highlighting
cask 'qlstephen' # Preview plain text files without a file extension. Example: README, CHANGELOG, etc.
cask 'qlmarkdown' # Preview Markdown files
cask 'quicklook-json' # Preview JSON files
cask 'qlprettypatch'  # Preview .patch files
cask 'quicklook-csv' # Preview CSV files
 cask 'betterzipql' # Preview archives
cask 'qlimagesize' # Display image size and resolution
cask 'webpquicklook' # Preview WebP images
cask 'suspicious-package' # Preview the contents of a standard Apple installer package

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fontawesome'

# Install Mac App Store apps
mas 'Airmail', id: 918858936
mas 'Better Rename 9', id: 414209656
mas 'CodeBox', id: 412536790
mas 'DaisyDisk', id: 411643860
mas 'iMovie', id: 408981434
mas 'Keynote', id: 409183694
mas 'Gapplin', id: 768053424
mas 'Giphy Capture', id: 668208984
mas 'Moom', id: 419330170
mas 'MWeb', id: 408981434
mas 'Numbers', id: 409203825
mas 'Parcel', id: 639968404
mas 'Pages', id: 409201541
mas 'Paw', id: 584653203
mas 'Red Hot Timer', id: 929960914
mas 'Scrivener', id:418889511
mas 'Sip', id: 507257563
mas 'Skitch', id: 425955336
mas 'Todoist', id: 585829637
mas 'Tweetbot', id: 557168941